Tekla.Structures.Model.RebarHookData
The RebarHookData class defines the hook at the end of a reinforcing bar.
Hooks are used for anchoring purposes.

Tekla.Structures.Model.RebarHookData.Shape
Defines the shape of the hook. The options are:
NO_HOOK. Sets the angle, radius and length to 0.
HOOK_90_DEGREES.
HOOK_135_DEGREES.
HOOK_180_DEGREES.
CUSTOM_HOOK. The angle, radius and length values have to be set manually.

Tekla.Structures.Model.RebarHookData.Angle
The angle of the hook. The value is between -270 to +270 degrees.

Tekla.Structures.Model.RebarHookData.Radius
The bending radius of the hook.

Tekla.Structures.Model.RebarHookData.Length
The length of the straight part of the hook.

Tekla.Structures.Model.RebarHookData.#ctor
Instantiates a rebar hook data instance with empty members.